Repository: MinhTran0311/CovidDiary
Catalog: lib/commons/l10n/translation/intl_*.arb
Languages: vi

# language
source: English
vi: Việt Nam

# confirm_cancel
source: Cancel
vi: Hủy bỏ

# confirm_ok
source: OK
vi: Đồng ý

source: Test
vi: Kiểm tra

source: Hello
vi: Xin chào

source: Select
vi: Chọn

# text_field_error_empty_input
source: This field cannot be empty.
vi: Vui lòng điền thông tin.

# text_field_error_invalid_email
source: Email is not valid. Please try again.
vi: Email không hợp lệ. Vui lòng thử lại.

# text_field_error_invalid_phone_number
source: Phone number is not valid. Please try again.
vi: Số diện thoại không hợp lệ. Vui lòng thử lại

# phone_number_input
source: Enter your phone number
vi: Nhập số điện thoại của bạn

# password_input
source: Enter password
vi: Nhập mật khẩu

# confirm_password_input
source: Confirm password
vi: Xác nhận mật khẩu

# issue_input
source: Issue
vi: Sự cố gặp phải

# confirm_password_hint
source: Enter your confirm password
vi: Nhập lại mật khẩu của bạn

# phone_number_hint
source: Enter your phone number
vi: Nhập số điện thoại của bạn

# password_hint
source: Enter your password
vi: Nhập mật khẩu của bạn

# issue_hint
source: Enter your issue
vi: Nhập sự cố gặp phải

# email_hint
source: Enter your email
vi: Nhập email của bạn

# dob_hint
source: Enter your day of birth
vi: Nhập ngày sinh của bạn

# work_hint
source: Enter your work
vi: Nhập công việc của bạn

source: Forgot password?
vi: Quên mật khẩu?

# sign_in_button
source: Sign in
vi: Đăng nhập tài khoản

source: Sign in
vi: Đăng nhập

# sign_up_button
source: Sign up
vi: Đăng ký tài khoản

source: Sign up
vi: Đăng ký

# login_with_phone
source: Sign in with phone number
vi: Đăng nhập bằng số điện thoại

# login_with_appleID
source: Sign in with Apple
vi: Đăng nhập bằng Apple

# login_with_google
source: Sign in with Google
vi: Đăng nhập bằng Google

source: Confirm
vi: Xác nhận

source: Images
vi: Hình ảnh

source: Send
vi: Gửi

source: Gallery
vi: Thư viện ảnh

# wrong_otp_code
source: Incorrect OTP code. Please try again.
vi: Mã OTP nhập sai. Vui lòng nhập lại.

source: Resend OTP code
vi: Gửi lại mã OTP

# otp_input
source: Enter OTP code
vi: Nhập mã OTP

# dont_have_account
source: Don't have an account?
vi: Chưa có tài khoản?

source: Have an account?
vi: Đã có tài khoản?

# error_wrong_phone_number
source: Incorrect phone number. Please try again.
vi: Số điện thoại sai. Vui lòng thử lại.

# error_wrong_confirm_password
source: Incorrect confirm password. Please try again.
vi: Mật khẩu xác nhận không đúng. Vui lòng thử lại.

# error_wrong_password
source: Incorrect password. Please try again.
vi: Mật khẩu nhập sai. Vui lòng thử lại

# error_empty_phone_number
source: Please enter phone number.
vi: Vui lòng nhập số điện thoại.

# error_empty_password
source: Please enter password.
vi: Vui lòng nhập mật khẩu.

# error_short_password
source: Password must have at least 8 characters.
vi: Mật khẩu có độ dài ít nhất 8 kí tự.

# error_empty_confirm_password
source: Please confirm your password
vi: Vui lòng xác nhận lại mật khẩu.

# error_empty_email
source: Please enter E-mail.
vi: Vui lòng nhập E-mail

# error_wrong_email
source: Incorrect E-mail. Please try again.
vi: E-mail nhập sai. Vui lòng thử lại

# error_empty_issue
source: Please enter your issue.
vi: Vui lòng nhập nội dung sự cố

# error_occur_please_try_again
source: Something went wrong. Please try again.
vi: Đã có lỗi xảy ra. Vui lòng thử lại

# error_empty_input
source: Please fill input field
vi: Vui lòng điền thông tin

# otp_resent
source: Resent OTP
vi: Đã gửi lại OTP

# dashboard_hello
source: Hello
vi: Xin chào

# dashboard_detail
source: Detail
vi: Xem chi tiết

# dashboard_today_stats
source: Today stats
vi: Tình hình dịch bệnh hôm nay

# dashboard_world
source: Worldwide
vi: Thế giới

# dashboard_vn
source: Vietnam
vi: Việt Nam

# dashboard_infected
source: Infected
vi: Bị nhiễm

# dashboard_recovered
source: Recovered
vi: Khỏi bệnh

# dashboard_heath_track
source: Health tracking
vi: Theo dõi sức khỏe

# dashboard_heath_track_button
source: How are you today? Let me record it for you!
vi: Hôm nay bạn có khỏe không, để mình ghi lại nhé !

# dashboard_monday
source: Mo
vi: T2

# dashboard_tuesday
source: Tu
vi: T3

# dashboard_wednesday
source: We
vi: T4

# dashboard_thursday
source: Th
vi: T5

# dashboard_friday
source: Fr
vi: T6

# dashboard_saturday
source: Sa
vi: T7

# dashboard_sunday
source: Su
vi: CN

# dashboard_place_track
source: Place track
vi: Theo dõi điểm đến

# dashboard_place_you_visited
source: Place visited by you in lastest 21 days
vi: Những nơi bạn đã đến trong 21 ngày qua

# dashboard_place_track_button
source: Did you go anywhere today ? Note it down now!
vi: Hôm nay bạn có đi đâu không ? Ghi nhớ lại ngay!

# dashboard_more_place
source: And 12 other places ...
vi: Và 12 nơi khác ...

# on_boarding1
source: Always wear a mask as soon as you leave the house, go to public places, gather in crowds.
vi: Hãy luôn đeo khẩu trang ngay khi ra khỏi nhà, đến những nơi công cộng, tập trung đông người.

# on_boarding2
source: Only leave the house when absolutely necessary, always keep a note of your own journey..
vi: Chỉ ra khỏi nhà khi thật sự cần thiết, luôn ghi chú hành trình di chuyển của bản thân.

# on_boarding3
source: Hand washing is an effective way to prevent not only Covid-19 but also other respiratory diseases.
vi: Rửa tay là phương pháp hữu hiệu để ngăn ngừa không chỉ Covid-19 mà còn với các bệnh lý hô hấp khác

# on_boarding4
source: Check your health every day, immediately contact medical authorities if there are abnormal symptoms.
vi: Theo dõi sức khỏe mỗi ngày, liên hệ ngay cơ quan y tế khi có dấu hiệu bất thường.

# disease_info_app_bar_title
source: Disease information
vi: Thông tin dịch bệnh

# disease_info_cases
source: Cases
vi: Nhiễm

# disease_info_healed
source: Heals
vi: Khỏi

# disease_info_death
source: Deaths
vi: Tử vong

# disease_info_vietnam
source: Vietnam
vi: Việt Nam

# disease_info_world
source: World
vi: Thế giới

# disease_info_table_province
source: Province/City
vi: Tỉnh/Thành phố

# disease_info_table_nation
source: Nation
vi: Quốc gia

# disease_info_table_cases
source: Cases
vi: Nhiễm bệnh

# disease_info_table_healed
source: Heals
vi: Bình phục

# disease_info_table_deaths
source: Deaths
vi: Tử vong

# personal_achievement_app_bar_title
source: Achievement
vi: Danh hiệu

# report_title
source: Dear diary
vi: Tâm tư với nhật ký

# symptom_name_1
source: Coughing
vi: Ho

# symptom_name_2
source: Fever
vi: Sốt

# symptom_name_3
source: Shortness of breath
vi: Khó thở

# symptom_name_4
source: Vomiting
vi: Nôn / buồn nôn

# symptom_name_5
source: Headache
vi: Đau đầu

# symptom_name_6
source: Sore throat
vi: Đau họng

# symptom_name_7
source: Rash
vi: Nổi ban ngoài da

# symptom_name_8
source: Diarrhea
vi: Tiêu chảy

# symptom_severity_1
source: (light)
vi: nhẹ

# symptom_severity_2
source: (normal)
vi: vừa

# symptom_severity_3
source: (severe)
vi: nặng

# symptom_info_1_1
source: Once in a while, you get a cough. It may not be enough to be considered sick, but it does bother you a little.
vi: Thi thoảng, bạn bị ho một cái. Có thể nó không đủ để coi như là bị bệnh, nhưng nó có làm phiền bạn một chút ít.

# symptom_info_1_2
source: You feel like you have a cold. You cough enough to make you uncomfortable, and chances are high that if you don't have Covid you also have a cold or something.
vi: Bạn cảm giác như bạn bị cảm. Bạn ho đủ nhiều để khiến bạn khó chịu, và khả năng cao nếu bạn không mắc Covid thì bạn cũng bị cảm hay gì đó.

# symptom_info_1_3
source: You cough often. So often that you start to feel tired. Perhaps to this extent, you should see a doctor.
vi: Bạn ho thường xuyên. Thường xuyên đến nỗi bạn bắt đầu thấy mệt. Có lẽ đến mức này, bạn rất nên đi khám bệnh.

# symptom_info_2_1
source: You have a fever of 37-38 degrees Celsius. Fever can make you a little tired, but nothing too severe.
vi: Bạn bị sốt 37-38 độ C. Sốt có thể khiến bạn mệt một chút, nhưng không gì quá nặng.

# symptom_info_2_2
source: You have a fever of 38-39 degrees Celsius. This fever makes you too tired to do any heavy work, and you should take the day off sick today.
vi: Bạn bị sốt 38-39 độ C. Đợt sốt này khiến bạn quá mệt để làm việc gì nặng, và bạn nên nghỉ bệnh hôm nay.

# symptom_info_2_3
source: You have a fever of 39+ degrees Celsius. You have a severe fever, and you should take fever-reducing medicine to keep your body temperature low.
vi: Bạn bị sốt 39+ độ C. Bạn bị sốt nặng, và nên uống thuốc hạ sốt để giữ thân nhiệt thấp.

# symptom_info_3_1
source: You have chest tightness, stuffy nose, or general shortness of breath. You have to breathe harder than usual, and it can be a little uncomfortable, but hasn't had a major effect on your ability to breathe.
vi: Bạn bị tức ngực, nghẹt mũi, hay khó thở nói chung. Bạn phải thở mạnh hơn bình thường, và nó có thể khó chịu một chút, nhưng chưa ảnh hưởng lớn đến khả năng hô hấp.

# symptom_info_3_2
source: You have trouble breathing. Sometimes you have to short of breath because of lack of oxygen.
vi: Bạn bị khó thở. Thi thoảng bạn phải thở dốc vì thiếu oxy.

# symptom_info_3_3
source: You have severe shortness of breath. You have fainted at least once a day due to lack of oxygen. If you haven't been to the hospital you should go.
vi: Bạn bị khó thở nặng. Bạn đã ngất ít nhất 1 lần trong ngày vì thiếu oxy. Nếu bạn chưa đến bệnh viện thì bạn nên đến đó đi.

# symptom_info_4_1
source: Sometimes of the day you feel like vomiting.
vi: Nhiều lúc trong ngày, bạn thấy muốn ói.

# symptom_info_4_2
source: You vomited once a day.
vi: Bạn đã ói 1 lần trong ngày.

# symptom_info_4_3
source: You have vomited several times a day. You should eat well to ensure nutrition. Sometimes you should see a doctor
vi: Bạn đã ói nhiều lần trong ngày. Bạn nên ăn uống đầy đủ để đảm bảo dinh dưỡng. Có khi bạn nên đi khám

# symptom_info_5_1
source: You feel a headache. It's normal if you worked too hard today.
vi: Bạn cảm thấy nhức đầu. Chuyện bình thường nếu hôm nay bạn làm việc quá sức.

# symptom_info_5_2
source: You feel dizzy. You may fall down any moment.
vi: Bạn cảm thấy chóng mặt. Có thể bạn sẽ ngã xuống bất cứ lúc nào.

# symptom_info_5_3
source: You feel a headache. It may be throbbing, it may be intermittent, but it's unlikely to go away anytime soon if you don't go to the doctor.
vi: Bạn cảm thấy đau đầu. Có thể nó đau nhói, có thể nó đau giai giẳng, nhưng nó dường như sẽ không bớt đi sớm nếu bạn không đi khám.

# symptom_info_6_1
source: You feel dry in your throat. Make sure you drink enough water.
vi: Bạn cảm thấy khô họng. Nhớ uống đủ nước nha bạn.

# symptom_info_6_2
source: You feel a sore throat. You may want to cough. When you do, remember to cover your mouth or cough into your elbow, and wash your hands often.
vi: Bạn cảm thấy ngứa họng. Bạn có thể muốn ho. Khi đó, nhớ che miệng hoặc ho vào khuỷu tay, và rửa tay thường xuyên.

# symptom_info_6_3
source: You have a sore throat. You may have hoarseness. Perhaps you should see a doctor.
vi: Bạn cảm thấy đau họng. Bạn có thể bị khàn tiếng. Có lẽ bạn nên đi khám.

# health_report_response_positive
source: I'm so happy to talk with you!
vi: Mình rất vui khi bạn tâm tư với mình!

# health_report_response_negative
source: Don't be so negative, it will be over soon!
vi: Cố lên bạn ơi, dịch bệnh sẽ qua mau thôi!

# health_report_emotion_1
source: Happy
vi: Vui vẻ

# health_report_emotion_2
source: Satisfied
vi: Hài lòng

# health_report_emotion_3
source: Feel good
vi: Thoải mái

# health_report_emotion_4
source: Excited
vi: Phấn khởi

# health_report_emotion_5
source: Tired
vi: Mệt mỏi

# health_report_emotion_6
source: Sad
vi: Buồn

# health_report_emotion_7
source: Frustrated
vi: Chán nản

# health_report_emotion_8
source: Angry
vi: Bực bội

# symptom_report_response_positive
source: Have a good day
vi: Chúc bạn một ngày vui vẻ

# symptom_report_response_negative
source: If you're not feeling well, maybe you should stay home today.
vi: Nếu bạn không thấy khoẻ, có lẽ bạn nên ở nhà hôm nay.

# health_declaration_app_bar_title
source: Health declaration
vi: Ghi chú sức khỏe (nghiêm túc)

# health_declaration_first_question
source: Are you experiencing any of the following symptoms today?
vi: Trong ngày hôm nay, bạn có thấy xuất hiện dấu hiệu nào sau đây không ?

# health_declaration_second_question
source: Today, do you have contact with:
vi: Trong hôm nay, bạn có tiếp xúc với:

# health_declaration_covid_patient
source: Patients, people suspected of having Covid-19
vi: Người bệnh, người nghi ngờ mắc Covid-19

# health_declaration_nations
source: People from countries with Covid-19 cases
vi: Người từ quốc gia có ca bệnh Covid-19

# health_declaration_symptom
source: People with symptoms (fever, cough, ...)
vi: Người có biểu hiện (sốt, ho, khó thở, ...)

# health_declaration_do_again
source: Do it again
vi: Làm lại

# profile_info_title
source: User information
vi: Thông tin cá nhân

# profile_info_dob
source: Day of birth
vi: Ngày sinh

# profile_info_phone
source: Phone
vi: Điện thoại

# profile_info_work
source: Work
vi: Công việc

# profile_info_social
source: Social Network
vi: Mạng xã hội

# profile_info_achievement
source: Achievement
vi: Danh hiệu

# setting_title
source: Settings
vi: Tuỳ chọn

# setting_language
source: Language
vi: Ngôn ngữ

# setting_sound
source: Sounds
vi: Âm thanh

# setting_light_dark_theme
source: Dark mode
vi: Chủ đề tối

# setting_other
source: Others
vi: Tuỳ chọn khác

source: Visit history
vi: Danh sách điểm đến

# setting_achievement
source: Congratulate for achievements
vi: Hiển thị chúc mừng với achievement

# setting_notification
source: Remind me with notification
vi: Nhắc nhở với notification

# update_profile_name_displayed
source: Name displayed
vi: Tên hiển thị

# update_profile_connect_account
source: Connect Account
vi: Liên kết tài khoản

# vaccine_info_title
source: Vaccine Information
vi: Thông tin vắc xin

# vaccine_info_search_place_holder
source: Enter the name of vaccine
vi: Nhập tên vắc xin

# vaccine_info_made_in
source: Produced by
vi: Quốc gia sản xuất

# vaccine_info_effect
source: Effect
vi: Hiệu quả

# vaccine_info_nation_used
source: Number of nation using
vi: Số quốc gia sử dụng

# vaccine_info_dose
source: Dose
vi: Số liều

# vaccine_info_price
source: Price
vi: Giá thành

# vaccine_info_detail
source: Detail information
vi: Thông tin chi tiết

# vaccine_info_cant_find_info
source: Can't find vaccine information
vi: Không tìm thấy thông tin vắc xin

# movement_report_topQuestion
source: Where have you been?
vi: Bạn mới đi đâu về thế?

# movement_report_searchHint
source: Type to search
vi: Nhập để tìm kiếm

# movement_report_bottomQuestionNewLoc
source: Do you want to nickname this?
vi: Bạn có muốn đặt nickname cho vị trí này không?

# movement_report_bottomQuestionOldLoc
source: You chose this location?
vi: Bạn đã chọn vị trí này?

# movement_report_selectedLocationStr
source: Location:
vi: Bạn đã chọn:

# movement_report_cancelButtonStr
source: Cancel save
vi: Huỷ lưu

# movement_report_confirmNoNicknameButtonStr
source: No nickname
vi: Không nickname

# movement_report_confirmButtonStr
source: Confirm
vi: Xác nhận

# health_history_title
source: Health history
vi: Lịch sử sức khoẻ

# health_history_no_symptom
source: You're healthy this day. No symptoms!
vi: Hôm nay bạn khoẻ, không có triệu chứng gì hết!

source: Day
vi: Ngày

source: and
vi: và

# health_history_symptom
source: You had the following symptoms:
vi: Hôm này bạn bị:
